# SubStructure

SubStructure

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.sub_structure import SubStructure

# TODO update the JSON string below
json = "{}"
# create an instance of SubStructure from a JSON string
sub_structure_instance = SubStructure.from_json(json)
# print the JSON string representation of the object
print(SubStructure.to_json())

# convert the object into a dict
sub_structure_dict = sub_structure_instance.to_dict()
# create an instance of SubStructure from a dict
sub_structure_from_dict = SubStructure.from_dict(sub_structure_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)